#include <stdio.h>

int main(void)
{
    printf("%f\n",
           0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F +
               0.1F + 0.1F + 0.1F + 0.1F + 0.1F);
    // 5.0을 생각했으나 실제로는 4.999998
    // 오차가 있으므로 실수 표현 시 가급적 double 사용하기
    return 0;
}